package com.cbh.utils;

public class SensitiveWord {
	public static final String[] words = {
		"习近平", "中国", "李克强", "主席", "总统", "女优", "小泽玛莉亚", "强歼", "乱交", "色友", "婊子", "蒲团", "女女", "喷尿", "三級", "武腾兰", "凌辱", "暴干", "诱惑", "阴唇", "小泽圆", 
		"插插", "長瀨愛", "川島和津實", "草莓牛奶", "小澤園", "飯島愛", "星崎未來", "及川奈央", "朝河蘭", "夕樹舞子", "大澤惠", "金澤文子", "三浦愛佳", "慰安妇", "女教師", "武藤蘭", "学生妹", "无毛",
		"猛插", "护士", "A片", "A级", "喷精", "小穴", "黄色", "强暴", "破处", "精液", "幼交", "狂干", "兽交", "群交", "露毛", "武藤兰", "饭岛爱", "偷情", "叫床", "上床", "制服", "亚热", 
		"援交", "肉欲", "自摸", "18禁", "捆绑", "丝袜", "潮吹", "肛交", "群射", "内射", "臭作", "薄格", "調教", "近親", "連發", "乱伦", "偷拍", "無修正", "一本道", "1Pondo", "櫻井",
		"風花", "夜勤病栋", "菱恝", "麻衣", "三级", "吐血", "三个代表", "一党", "多党", "民主", "专政", "行房", "自慰", "吹萧", "色狼", "胸罩", "法轮", "法论", "法沦", "法伦", "发轮"
		, "发论", "发沦", "发伦", "轮功", "轮公", "轮攻", "沦功", "沦公", "沦攻", "论攻", "论功", "论公", "伦攻", "伦功", "伦公", "打倒", "民运", "六四", "台独", "王丹", "天安门", "江泽民"
		, "柴玲", "李鹏", "朱容基", "朱镕基", "李长春", "李瑞环", "胡锦涛", "魏京生", "台湾独立", "藏独", "西藏独立", "疆独", "新疆独立", "自焚", "骗局", "猫肉", "吸储", "紅志", "紅智", "法輪"
		, "法論", "法淪", "法倫", "發輪", "發論", "發淪", "發倫", "輪功", "輪公", "輪攻", "淪功", "淪公", "淪攻", "論攻", "論功", "論公", "倫攻", "倫功", "倫公", "民運", "台獨", "李鵬",
		"天安門", "江澤民", "朱鎔基", "李長春", "李瑞環", "胡錦濤", "臺灣獨立", "藏獨", "西藏獨立", "疆獨", "新疆獨立", "鄧小平", "書記"
	};
	
	public static boolean search(String target) {
		for (String word : words) {
			boolean result = target.contains(word);
			if (result) {
				return false;
			}
		}
		
		return true;
	}
}
